app/controllers/api/comments_controller.rb

SELECT "comments"."id" FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 48]]
---
  def index
    @comments = Comment.all.where(post_id: params[:post_id])

INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 15], ["post_id", 31], ["body", "amazing bokeh.."], ["created_at", "2019-11-18 18:48:35.945889"], ["updated_at", "2019-11-18 18:48:35.945889"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id

    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
  def destroy
    @comment = Comment.find_by(id: params[:id])

    if @comment && @comment.user_id == current_user.id
      @comment.destroy