app/controllers/api/likes_controller.rb

  def create
    @like = Like.new(like_params)
    @like.user_id = current_user.id

    if @like.save
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 6], ["created_at", "2019-11-15 17:40:32.743346"], ["updated_at", "2019-11-15 17:40:32.743346"]]

  def destroy
    @like = Like.find_by(user_id: current_user.id, post_id: params[:id])
    if @like
      @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 6], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]