app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("user_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["title", "this is pretty"], ["created_at", "2019-11-14 18:03:50.042380"], ["updated_at", "2019-11-14 18:03:50.042380"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save

UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2019-11-14 18:03:50.047739"], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])
      if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
      if @post.user_id = current_user.id
        @post.destroy