app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.profile_photo.attach(io: File.open("#{Rails.root}/app/assets/images/profile_photo_default.jpg"), filename: "profile_photo_default.jpg")

    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user = current_user

    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2019-11-19 04:39:50.263122"], ["id", 20]]