app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "RKixGcijPAdOp1lB73OldQ"], ["updated_at", "2019-11-11 22:37:49.513441"], ["id", 1]]
---
  def reset_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save