app/models/user.rb

  def reset_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "HVabJj4nffbPqsQFMeDJCQ"], ["updated_at", "2019-11-16 00:40:48.319386"], ["id", 1]]